Revit 2027 API
ElectricalAnalyticalLoadSet.QuantityOnStandBy Property
 The number of Equipment Loads that are not operational at any time.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int QuantityOnStandBy { get; set; }
Public Property QuantityOnStandBy As Integer
	Get
	Set
public:
property int QuantityOnStandBy {
	int get ();
	void set (int value);
}
member QuantityOnStandBy : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The number is greater than the total count of the Equipment Loads in the LoadSet.
ArgumentOutOfRangeException |  When setting this property: The given value for number is negative.
Remarks
 The equipment loads with smaller load value within the set are considered on standby. Must be between 0 and (total count of the Equipment Loads in the LoadSet)
See Also
Reference
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace